max33=[57     5    40    60    31    52    41    34    51    46     1    39     6    59     4     3    47     7    53    42    35    56    62 33    48    17     8    66    15    11    32    26    58]
max16 =  [ 57     5    40    60    31    52    41    34    51    46     1    39     6    59    26    58];;
zuixiaoshengchengshu_yuanlai = [ 5    51    60    57    52    40    31     1    59    26    58];
%setglobal();
chongqingchengdu=[644.1624]
2901
%新人口 5 7 之间价值最大，是6405.3 
setglobal();
graph33 =[57     5    40    60    31    52    41    34    51    46     1    39     6    59     4     3    47     7    53    42    35    56    62 33    48    17     8    66    15    11    32    26    58]
setglobal();
code23(graph33)
%第二问新人口28758+6405*5或22
%第一问新人口2901+644*5或22